Aprovechamos la imagen de docker para conectarno as dw netflix

In [1]:
import pandas as pd
import sqlalchemy as sa

In [3]:
engine = sa.create_engine("mysql://root:root@172.16.5.4:3310/dw_netflix")
conn = engine.connect()

In [6]:
query = 'SELECT * FROM FactWatchs'
fact_watchs = pd.read_sql(query, conn)
fact_watchs.head(5)

    userID   movieID  rating           timestamp
0  1002331  80192187     4.9 2024-02-29 14:23:17
1  1002331  80210920     3.0 2024-03-30 08:26:36
2  1002331  81157374     3.9 2024-02-17 16:58:53
3  1002332  80192187     4.5 2024-02-06 23:04:16
4  1002332  80210920     2.3 2024-03-19 16:10:02

In [7]:
query = 'SELECT * FROM dimUser'
user = pd.read_sql(query, conn)
user.head(5)

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [8]:
query = 'SELECT * FROM dimMovie'
movie = pd.read_sql(query, conn)
movie.head(5)

,movieID,title,releaseMovie,gender,participantName,roleparticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy